In [ ]:
import numpy as np
import pandas as pd
from IPython.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

## 46. Create Datetime Series and index with Datetime series
<pre>
Requirement:
1. Create Datetime series idx :
            [four consecutive days] with dtype=datetime64[ns]
            from 2023-01-01 to 2023-01-04
2. Create Datetime series idxy based on idx' year, index with idx
3. Create Datetime series idxm based on idx' month, index with idx            
4. Create Datetime series idxd based on idx' day, index with idx           
</pre>

In [ ]:
idx = pd.Series(pd.date_range(start='2023-01-01', periods=4, freq='D'))
#idxCreate Datetime Series and index with Datetime series
idx

0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
dtype: datetime64[ns]

In [ ]:
idxy = idx.dt.year
idxy.index=idx
idxy

2023-01-01    2023
2023-01-02    2023
2023-01-03    2023
2023-01-04    2023
dtype: int32

In [ ]:
idxm = idx.dt.month
idxm.index=idx
idxm

2023-01-01    1
2023-01-02    1
2023-01-03    1
2023-01-04    1
dtype: int32

In [ ]:
idxd = idx.dt.day
idxd.index=idx
idxd

2023-01-01    1
2023-01-02    2
2023-01-03    3
2023-01-04    4
dtype: int32

## 47. Create series with dtype and index with Datetime series
<pre>
Requirement:
1. Create series s1 [1, 2, 3, 4] 
                with dtype='int32', index with idx
2. Create series s2 [5., 6., 7., 8.] 
                with dtype='float32', index with idx</pre>

In [ ]:
s1 = pd.Series([1, 2, 3, 4], dtype='int32', index=idx)
s1

2023-01-01    1
2023-01-02    2
2023-01-03    3
2023-01-04    4
dtype: int32

In [ ]:
s2 = pd.Series([5., 6., 7., 8.], dtype='float32', index=idx)
s2

2023-01-01    5.0
2023-01-02    6.0
2023-01-03    7.0
2023-01-04    8.0
dtype: float32

## 48. Create series with dtype and index with Datetime series
<pre>
Requirement:
1. Create series s3 ['On','Off','On', 'Off'] 
                    with dtype='category', index with idx
2. Create series s4 ['Alex','Bob','Chris','David'] 
                    with dtype='object', index with idx
</pre>

In [ ]:
s3 = pd.Series(['On','Off','On', 'Off'], dtype='category', index=idx)
s3

2023-01-01     On
2023-01-02    Off
2023-01-03     On
2023-01-04    Off
dtype: category
Categories (2, object): ['Off', 'On']

In [ ]:
s4 = pd.Series(['Alex','Bob','Chris','David'], dtype='object', index=idx)
s4

2023-01-01     Alex
2023-01-02      Bob
2023-01-03    Chris
2023-01-04    David
dtype: object

## 49. Combine Series into DataFrame
<pre>Column and Series, respectively as follow:
'year':idxy,
'month':idxm,
'day':idxd,
'name':s4,
'sales':s1,
'income':s2,
'desktop':s3,
</pre>

In [ ]:
df = pd.DataFrame(data={'year':idxy,
                   'month':idxm,
                   'day':idxd,
                   'name':s4,
                   'sales':s1,
                   'income':s2,
                   'desktop':s3,})
df

            year  month  day   name  sales  income desktop
2023-01-01  2023      1    1   Alex      1     5.0      On
2023-01-02  2023      1    2    Bob      2     6.0     Off
2023-01-03  2023      1    3  Chris      3     7.0      On
2023-01-04  2023      1    4  David      4     8.0     Off

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2023-01-01 to 2023-01-04
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     4 non-null      int32
 1   month    4 non-null      int32
 2   day      4 non-null      int32
 3   name     4 non-null      object
 4   sales    4 non-null      int32
 5   income   4 non-null      float32
 6   desktop  4 non-null      category
dtypes: category(1), float32(1), int32(4), object(1)
memory usage: 272.0+ bytes

## 50. Add new column with value by np.where
<pre>Requirement:
1. Add a new column 'bonus' to the df
2. Caluculate the bonus if sales>=3, bonus=income*0.3
                        else bonus=0
</pre>

In [ ]:
df.loc[df.index, 'bonus'] = np.where(df['sales']>=3, 
                                     df['income']*.3, 
                                     0)

In [ ]:
df

            year  month  day   name  sales  income desktop  bonus
2023-01-01  2023      1    1   Alex      1     5.0      On    0.0
2023-01-02  2023      1    2    Bob      2     6.0     Off    0.0
2023-01-03  2023      1    3  Chris      3     7.0      On    2.1
2023-01-04  2023      1    4  David      4     8.0     Off    2.4

In [ ]:
df.loc[df.index]

## 51. Zip column and calculation
<pre>Requirement:
Generate a salary list, name with income+bonus

Desired Output:
[('Alex', 5.0),
 ('Bob', 6.0),
 ('Chris', 9.100000381469727),
 ('David', 10.399999618530273)]
</pre>

In [ ]:
salary = list(zip( df.name, df.income+df.bonus ))
salary

[('Alex', 5.0),
 ('Bob', 6.0),
 ('Chris', 9.100000381469727),
 ('David', 10.399999618530273)]

In [ ]:
pd.DataFrame(data={'Name':df.name,
             'TotalIncome':df.income+df.bonus})

             Name  TotalIncome
2023-01-01   Alex          5.0
2023-01-02    Bob          6.0
2023-01-03  Chris          9.1
2023-01-04  David         10.4

## 52. Filter and manipulate DF 
<pre>Given Input:
salary = pd.DataFrame(data={'Name':df.name,
             'TotalIncome':df.income+df.bonus})

Requirement:
1. Find out the average salary
2. Total amount the company should prepare for payroll
3. Find out the highest performer (highest income)
4. Find out the standard diviation of the salary

In [ ]:
salary = pd.DataFrame(data={'Name':df.name,
             'TotalIncome':df.income+df.bonus})
salary

             Name  TotalIncome
2023-01-01   Alex          5.0
2023-01-02    Bob          6.0
2023-01-03  Chris          9.1
2023-01-04  David         10.4

In [ ]:
# average salary
salary['TotalIncome'].mean()

7.625

In [ ]:
# Amount for payroll
salary['TotalIncome'].sum()

30.5

In [ ]:
# highest income name
salary['Name'].loc[salary['TotalIncome'].idxmax()]

'David'

In [ ]:
# Standard Deviation
salary['TotalIncome'].std()

2.5434556

## 53. Series str
<pre>IT department need to create email account for
everyone, the email will be name + @abc.com
create a column 'email' and fill the email for every one.
The email should not include capital letter.
</pre>

In [ ]:
df['email'] = df['name'].apply(str.lower)+'@abc.com'
df

,year,month,day,name,sales,income,desktop,bonus,email
2023-01-01,2023,1,1,Alex,1,5.0,On,0.0,alex@abc.com
2023-01-02,2023,1,2,Bob,2,6.0,Off,0.0,bob@abc.com
2023-01-03,2023,1,3,Chris,3,7.0,On,2.1,chris@abc.com
2023-01-04,2023,1,4,David,4,8.0,Off,2.4,david@abc.com

## 54. Query and Search string
<pre>Find the following data:
1. sales smaller and equal 2 and desktop is "Off"
2. name start with 'A'
</pre>

In [ ]:
df.query('sales <= 2 and desktop == "Off"')

            year  month  day name  sales  income desktop  bonus        email
2023-01-02  2023      1    2  Bob      2     6.0     Off    0.0  bob@abc.com

In [ ]:
df.loc[df['name'].str.startswith('A')==True]

            year  month  day  name  sales  income desktop  bonus         email
2023-01-01  2023      1    1  Alex      1     5.0      On    0.0  alex@abc.com

## 55. Series Self Transform
<pre>The company want to increase basic income.
For income smaller than 7, raise 5%, else raise 3%.
Modify the income column with above condition.
</pre>

In [ ]:
df['income'] = df['income'].transform(lambda x: x*1.05 if x<7 else x*1.03)

In [ ]:
df

,year,month,day,name,sales,income,desktop,bonus,email
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com

## 56. Rename column
<pre>Rename the following column:
desktop to laptop
income to basicSalary
</pre>

In [ ]:
df = df.rename(columns={'desktop':'laptop',
                   'income':'basicSalary'})
df

,year,month,day,name,sales,basicSalary,laptop,bonus,email
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com

## 57. Assign new columns to DataFrame
<pre>Use df.assign() function to add new column 'totalSalary'
that equal to basicSalary plus bonus.
</pre>

In [ ]:
df = df.assign(totalSalary=df['basicSalary']+df['bonus'])
df

,year,month,day,name,sales,basicSalary,laptop,bonus,email,totalSalary
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com,5.25
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com,6.30
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com,9.31
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com,10.64

## 58. Manipulate categoric data
<pre>Find out:
1. unique data in 'laptop'
2. number of unique data in 'laptop'
3. how many count in each unique data</pre>

In [ ]:
df['laptop'].unique()

['On', 'Off']
Categories (2, object): ['Off', 'On']

In [ ]:
df['laptop'].nunique()

2

In [ ]:
df['laptop'].value_counts()

laptop
Off    2
On     2
Name: count, dtype: int64

In [ ]:
df.laptop

2023-01-01     On
2023-01-02    Off
2023-01-03     On
2023-01-04    Off
Name: laptop, dtype: category
Categories (2, object): ['Off', 'On']

## 59. Create categoric data column with others values
<pre>Creaet new column 'role' and classify employee role in 3 classes
by 'basicSalary'. 
below 6 is Junior, 
below 8 is Senior, 
above 8 is Manager.
Hint: use pd.cut()
</pre>

In [ ]:
df['role'] = pd.cut(df['basicSalary'],
      bins=[0, 6, 8, float('Inf')],
      labels=['Junior', 'Senior', 'Manager'])
df

,year,month,day,name,sales,basicSalary,laptop,bonus,email,totalSalary,role
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com,5.25,Junior
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com,6.30,Senior
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com,9.31,Senior
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com,10.64,Manager

## 60. Create categoric data column with quantile classes
<pre>Use pd.qcut to classify the 'totalSalary' in 
"Low Income", "Medium Income", "High Income", which base on 
'totalSalary' quantile.
Create new column named 'salaryClass'.
</pre>

In [ ]:
df['salaryClass'] = pd.qcut(df['totalSalary'], 3, labels=[
    "Low Income", "Medium Income", "High Income"])
df

,year,month,day,name,sales,basicSalary,laptop,bonus,email,totalSalary,role,salaryClass
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com,5.25,Junior,Low Income
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com,6.30,Senior,Low Income
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com,9.31,Senior,High Income
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com,10.64,Manager,High Income

## 61. Evaluate a Python expression as a string using various backends.
<pre>Create a temp column 'ExpectedAnnualSalary' to calculate
expected full year salary which is totalSalary x 13
</pre>

In [ ]:
pd.eval("ExpectedAnnualSalary = df.totalSalary * 13", target=df)

,year,month,day,name,sales,basicSalary,laptop,bonus,email,totalSalary,role,salaryClass,ExpectedAnnualSalary
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com,5.25,Junior,Low Income,68.250000
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com,6.30,Senior,Low Income,81.900000
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com,9.31,Senior,High Income,121.030002
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com,10.64,Manager,High Income,138.320001

In [ ]:
df

,year,month,day,name,sales,basicSalary,laptop,bonus,email,totalSalary,role,salaryClass
2023-01-01,2023,1,1,Alex,1,5.25,On,0.0,alex@abc.com,5.25,Junior,Low Income
2023-01-02,2023,1,2,Bob,2,6.30,Off,0.0,bob@abc.com,6.30,Senior,Low Income
2023-01-03,2023,1,3,Chris,3,7.21,On,2.1,chris@abc.com,9.31,Senior,High Income
2023-01-04,2023,1,4,David,4,8.24,Off,2.4,david@abc.com,10.64,Manager,High Income